const desire = ["Ти найкращий", 
    "Твоя усмішка робить світ яскравішим – не забувай посміхатися!", 
    "Ти чудова людина, і сьогодні в тебе все вийде!", 
    "Світ потребує саме тебе – будь собою і сяй!", 
    "Кожен новий день – це можливість стати ще кращим!", 
    "Ти заслуговуєш на щастя. Дозволь собі радіти навіть дрібницям!", 
    "Навіть у хмарний день ти випромінюєш світло!", 
    "Ти сильний(а), розумний(а) і здатний(а) на більше, ніж думаєш!", 
    "Посміхнись! Можливо, хтось саме зараз цього дуже потребує.", 
    "Ти неповторний(а), і в цьому твоя суперсила!", 
    "Світ кращий, бо в ньому є ти!"
]

    export const showRandDesire = function () {
    const randIndex = Math.floor(Math.random() * desire.length);
    document.querySelector(".dream-text").textContent = desire[randIndex];
}

